// 接口调用返回
var resultCode = {
        1001: '接口执行成功',
        1002: '令牌失效',
        1003: '令牌为空',
        1004: '令牌头不存在',
        1005: '令牌错误',
        1006: '未授权',
        2001: '用户名或密码错误',
        2002: '查询限制',
        2003: '参数为空',
        9001: '失败',
        9002: '排序出错',
        9003: '校验失败'
    }
    // 证件类型
var cardType = {
    1: '一代身份证',
    2: '二代身份证正面',
    3: '二代身份证证背面',
    4: '临时身份证',
    5: '驾照',
    6: '行驶证',
    7: '军官证',
    9: '中华人民共和国往来港澳通行证(护照幅面)',
    10: '台湾居民往来大陆通行证(护照幅面)',
    11: '大陆居民往来台湾通行证(护照幅面)',
    12: '签证(护照幅面)',
    13: '护照(护照幅面)',
    14: '港澳居民来往内地通行证正面(卡幅面)',
    15: '港澳居民来往内地通行证背面(卡幅面)',
    16: '户口本',
    17: '银行卡',
    19: '车牌',
    20: '名片',
    1000: '居住证',
    1001: '香港永久性居民身份证',
    1002: '登机牌（拍照设备目前不支持登机牌的识别）',
    1003: '边民证（A）（照片页）',
    1004: '边民证（B）（个人信息页）',
    1005: '澳门身份证',
    1006: '领取凭证(AVA6支持)',
    1007: '律师证（A）（信息页)',
    1008: '律师证（B） （照片页）',
    1030: '"全民健康保险卡',
    1031: '台湾身份证正面',
    1032: '台湾身份证背面',
}
module.exports = {
    resultCode: resultCode,
    cardType: cardType
}